# UmPerMDegreeC Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..UmPerMDegreeC Property
SymbolTypeId Class See Also
---
Symbol µm/(m·°C), indicating unit Micrometers per meter degree Celsius.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId UmPerMDegreeC { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UmPerMDegreeC As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ UmPerMDegreeC {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace